In [1]:
import pandas as pd
import numpy as np

In [2]:
sales = pd.read_csv("sales.csv")

In [3]:
sales.head()

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
4   JAN  B100  HYD   30.0

In [5]:
sales.shape

(10, 4)

In [6]:
sales.columns

Index(['Month', 'Book', 'City', 'Units'], dtype='object')

In [7]:
sales.index

RangeIndex(start=0, stop=10, step=1)

In [8]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Month    10 non-null object
Book     10 non-null object
City     9 non-null object
Units    9 non-null float64
dtypes: float64(1), object(3)
memory usage: 448.0+ bytes

In [10]:
sales.describe(include="all")

       Month  Book City      Units
count     10    10    9   9.000000
unique     3     3    2        NaN
top      JAN  B100  VZG        NaN
freq       4     6    5        NaN
mean     NaN   NaN  NaN  16.111111
std      NaN   NaN  NaN  12.046207
min      NaN   NaN  NaN   4.000000
25%      NaN   NaN  NaN  10.000000
50%      NaN   NaN  NaN  13.000000
75%      NaN   NaN  NaN  20.000000
max      NaN   NaN  NaN  40.000000

### selecting rows and columns

In [6]:
sales['Units']

0    10.0
1    20.0
2     4.0
3    13.0
4    30.0
5    40.0
6    10.0
7    14.0
8     NaN
9     4.0
Name: Units, dtype: float64

In [7]:
sales.City

0    VZG
1    VZG
2    VZG
3    VZG
4    HYD
5    HYD
6    HYD
7    VZG
8    HYD
9    NaN
Name: City, dtype: object

In [8]:
sales[['Month','Units']]

  Month  Units
0   JAN   10.0
1   JAN   20.0
2   FEB    4.0
3   MAR   13.0
4   JAN   30.0
5   FEB   40.0
6   MAR   10.0
7   JAN   14.0
8   FEB    NaN
9   MAR    4.0

In [21]:
sales.Units.mean()

16.11111111111111

In [24]:
# sales.Units is a series so apply methods of Series 
sales.Units.apply(lambda v : 'Above Target' if v > 5 else 'Below Target')

0    Above Target
1    Above Target
2    Below Target
3    Above Target
4    Above Target
5    Above Target
6    Above Target
7    Above Target
8    Below Target
9    Below Target
Name: Units, dtype: object

#### loc and iloc

In [9]:
sales.loc[4,'Units']

30.0

In [10]:
sales.iloc[0,0]

'JAN'

In [15]:
sales.loc[:4]

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
4   JAN  B100  HYD   30.0

In [14]:
sales.loc[:4,'Book':'Units']

   Book City  Units
0  B100  VZG   10.0
1  B300  VZG   20.0
2  B100  VZG    4.0
3  B100  VZG   13.0
4  B100  HYD   30.0

In [16]:
sales.iloc[:5, [0,3] ]

  Month  Units
0   JAN   10.0
1   JAN   20.0
2   FEB    4.0
3   MAR   13.0
4   JAN   30.0

In [17]:
sales.iloc[:3, :2]

  Month  Book
0   JAN  B100
1   JAN  B300
2   FEB  B100

In [18]:
sales.iloc[[0,4,6], [0,1,3]]

  Month  Book  Units
0   JAN  B100   10.0
4   JAN  B100   30.0
6   MAR  B100   10.0

In [19]:
sales.loc[[1,4,7], ['Month','Units']]

  Month  Units
1   JAN   20.0
4   JAN   30.0
7   JAN   14.0

#### at and iat

In [15]:
sales.iat[0,2]

'VZG'

In [16]:
sales.at[0,'City']

'VZG'

In [28]:
sales.sample(5)

  Month  Book City  Units
8   FEB  B200  HYD    NaN
2   FEB  B100  VZG    4.0
7   JAN  B200  VZG   14.0
6   MAR  B100  HYD   10.0
9   MAR  B200  NaN    4.0

#### isin()

In [32]:
sales.City.isin(['VZG','BAN'])

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7     True
8    False
9    False
Name: City, dtype: bool

In [29]:
sales.isin(['JAN','VZG'])

   Month   Book   City  Units
0   True  False   True  False
1   True  False   True  False
2  False  False   True  False
3  False  False   True  False
4   True  False  False  False
5  False  False  False  False
6  False  False  False  False
7   True  False   True  False
8  False  False  False  False
9  False  False  False  False

In [33]:
sales.where( sales['Units'] < 10)

  Month  Book City  Units
0   NaN   NaN  NaN    NaN
1   NaN   NaN  NaN    NaN
2   FEB  B100  VZG    4.0
3   NaN   NaN  NaN    NaN
4   NaN   NaN  NaN    NaN
5   NaN   NaN  NaN    NaN
6   NaN   NaN  NaN    NaN
7   NaN   NaN  NaN    NaN
8   NaN   NaN  NaN    NaN
9   MAR  B200  NaN    4.0

#### Boolean Indexing

In [34]:
sales['Units'] < 10

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: Units, dtype: bool

In [35]:
sales.loc[sales['Units'] < 10]

  Month  Book City  Units
2   FEB  B100  VZG    4.0
9   MAR  B200  NaN    4.0

In [36]:
sales.loc[sales['Units'] < 10, ['Book','Units']]

   Book  Units
2  B100    4.0
9  B200    4.0

In [37]:
sales.nlargest(3,'Units')

  Month  Book City  Units
5   FEB  B100  HYD   40.0
4   JAN  B100  HYD   30.0
1   JAN  B300  VZG   20.0

In [38]:
sales.nsmallest(3,'Units')

  Month  Book City  Units
2   FEB  B100  VZG    4.0
9   MAR  B200  NaN    4.0
0   JAN  B100  VZG   10.0

In [40]:
sales.filter(regex='i')  # Select columns that have letter i in name

  City  Units
0  VZG   10.0
1  VZG   20.0
2  VZG    4.0
3  VZG   13.0
4  HYD   30.0
5  HYD   40.0
6  HYD   10.0
7  VZG   14.0
8  HYD    NaN
9  NaN    4.0

In [42]:
sales.filter(regex='1|5',axis=0)  # Row labels with values 1 or 5

  Month  Book City  Units
1   JAN  B300  VZG   20.0
5   FEB  B100  HYD   40.0

#### apply() and applymap()

In [48]:
sales.apply(lambda s: s.notna().sum(), axis=1) # Count nonnull values in each row

0    4
1    4
2    4
3    4
4    4
5    4
6    4
7    4
8    3
9    3
dtype: int64

In [45]:
sales.apply(lambda s: s.isna().any(), axis=1) # Which rows have at least one null

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
dtype: bool

In [46]:
sales.apply(lambda s: s.isna().any()) # columns that have at least one null value

Month    False
Book     False
City      True
Units     True
dtype: bool

In [27]:
sales[ ['Month','Units']].apply(lambda s: s.count(), axis = 0)  # Column-wise

Month    10
Units     9
dtype: int64

In [49]:
sales.applymap(lambda v : f"{v:.3}")

  Month Book City Units
0   JAN  B10  VZG  10.0
1   JAN  B30  VZG  20.0
2   FEB  B10  VZG   4.0
3   MAR  B10  VZG  13.0
4   JAN  B10  HYD  30.0
5   FEB  B10  HYD  40.0
6   MAR  B10  HYD  10.0
7   JAN  B20  VZG  14.0
8   FEB  B20  HYD   nan
9   MAR  B20  nan   4.0

####  str attribute

In [5]:
# sales.Month.startswith("J")

In [9]:
sales.Month.str.startswith('J')

0     True
1     True
2    False
3    False
4     True
5    False
6    False
7     True
8    False
9    False
Name: Month, dtype: bool

In [30]:
sales[sales['Month'].str.startswith ('J')]

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
4   JAN  B100  HYD   30.0
7   JAN  B200  VZG   14.0

In [8]:
sales.columns.str.lower()

Index(['month', 'book', 'city', 'units'], dtype='object')

### Adding and deleting rows

In [10]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
4   JAN  B100  HYD   30.0
5   FEB  B100  HYD   40.0
6   MAR  B100  HYD   10.0
7   JAN  B200  VZG   14.0
8   FEB  B200  HYD    NaN
9   MAR  B200  NaN    4.0

In [12]:
sales.append({'Month':'MAR', 'Book' : 'B100', 'Units' : 15}, ignore_index = True)

   Month  Book City  Units
0    JAN  B100  VZG   10.0
1    JAN  B300  VZG   20.0
2    FEB  B100  VZG    4.0
3    MAR  B100  VZG   13.0
4    JAN  B100  HYD   30.0
5    FEB  B100  HYD   40.0
6    MAR  B100  HYD   10.0
7    JAN  B200  VZG   14.0
8    FEB  B200  HYD    NaN
9    MAR  B200  NaN    4.0
10   MAR  B100  NaN   15.0

In [18]:
sales.drop ([0,4])  # Drop rows by given indicies

  Month  Book City  Units
1   JAN  B300  VZG   20.0
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
5   FEB  B100  HYD   40.0
6   MAR  B100  HYD   10.0
7   JAN  B200  VZG   14.0
8   FEB  B200  HYD    NaN
9   MAR  B200  NaN    4.0

In [17]:
sales.drop(['Month','City'],axis=1) # Drop given columns

   Book  Units
0  B100   10.0
1  B300   20.0
2  B100    4.0
3  B100   13.0
4  B100   30.0
5  B100   40.0
6  B100   10.0
7  B200   14.0
8  B200    NaN
9  B200    4.0

In [34]:
sales.drop(columns=['Book'])

  Month City  Units
0   JAN  VZG   10.0
1   JAN  VZG   20.0
2   FEB  VZG    4.0
3   MAR  VZG   13.0
4   JAN  HYD   30.0
5   FEB  HYD   40.0
6   MAR  HYD   10.0
7   JAN  VZG   14.0
8   FEB  HYD    NaN
9   MAR  NaN    4.0

In [28]:
# Add new row at the given index 
sales.loc[11] = {'Month':'MAR', 'Book': 'B100','City':'HYD', 'Units' : 10}

In [29]:
sales

   Month  Book City Units
0    JAN  B100  VZG    10
1    JAN  B300  VZG    20
2    FEB  B100  VZG     4
3    MAR  B100  VZG    13
4    JAN  B100  HYD    30
5    FEB  B100  HYD    40
6    MAR  B100  HYD    10
7    JAN  B200  VZG    14
8    FEB  B200  HYD   NaN
9    MAR  B200  NaN     4
11   MAR  B100  HYD    10

In [30]:
# Modify new row at the given index 
sales.loc[11] = {'Month':'APR', 'Book': 'B100','City':'HYD', 'Units' : 20}

In [31]:
sales

   Month  Book City Units
0    JAN  B100  VZG    10
1    JAN  B300  VZG    20
2    FEB  B100  VZG     4
3    MAR  B100  VZG    13
4    JAN  B100  HYD    30
5    FEB  B100  HYD    40
6    MAR  B100  HYD    10
7    JAN  B200  VZG    14
8    FEB  B200  HYD   NaN
9    MAR  B200  NaN     4
11   APR  B100  HYD    20

In [32]:
sales.loc[12] = ['MAR', 'B200','HYD', 20]

In [33]:
sales

   Month  Book City Units
0    JAN  B100  VZG    10
1    JAN  B300  VZG    20
2    FEB  B100  VZG     4
3    MAR  B100  VZG    13
4    JAN  B100  HYD    30
5    FEB  B100  HYD    40
6    MAR  B100  HYD    10
7    JAN  B200  VZG    14
8    FEB  B200  HYD   NaN
9    MAR  B200  NaN     4
11   APR  B100  HYD    20
12   MAR  B200  HYD    20

### Adding columns

In [34]:
sales['Tax'] = 15

In [35]:
sales

   Month  Book City Units  Tax
0    JAN  B100  VZG    10   15
1    JAN  B300  VZG    20   15
2    FEB  B100  VZG     4   15
3    MAR  B100  VZG    13   15
4    JAN  B100  HYD    30   15
5    FEB  B100  HYD    40   15
6    MAR  B100  HYD    10   15
7    JAN  B200  VZG    14   15
8    FEB  B200  HYD   NaN   15
9    MAR  B200  NaN     4   15
11   APR  B100  HYD    20   15
12   MAR  B200  HYD    20   15

In [37]:
sales['Gap'] = sales['Units'] - 5

In [38]:
sales

   Month  Book City Units  Tax  Gap
0    JAN  B100  VZG    10   15    5
1    JAN  B300  VZG    20   15   15
2    FEB  B100  VZG     4   15   -1
3    MAR  B100  VZG    13   15    8
4    JAN  B100  HYD    30   15   25
5    FEB  B100  HYD    40   15   35
6    MAR  B100  HYD    10   15    5
7    JAN  B200  VZG    14   15    9
8    FEB  B200  HYD   NaN   15  NaN
9    MAR  B200  NaN     4   15   -1
11   APR  B100  HYD    20   15   15
12   MAR  B200  HYD    20   15   15

#### Concatenate

In [6]:
df1 = pd.DataFrame ( {'name' : ['A','B','C'], 'age' : [30,40,50]})
df2 = pd.DataFrame ( {'name' : ['X','Y'], 'age' : [40,20]})
df3 = pd.DataFrame ( {'name' : ['A','B','D'], 'gender' : ['M','F','M']})

In [41]:
df1

  name  age
0    A   30
1    B   40
2    C   50

In [42]:
df2

  name  age
0    X   40
1    Y   20

In [46]:
pd.concat( (df1,df2))

  name  age
0    A   30
1    B   40
2    C   50
0    X   40
1    Y   20

In [47]:
pd.concat( (df1,df2), ignore_index=True)

  name  age
0    A   30
1    B   40
2    C   50
3    X   40
4    Y   20

In [49]:
pd.concat((df1,df3), ignore_index=True)

d:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    age gender name
0  30.0    NaN    A
1  40.0    NaN    B
2  50.0    NaN    C
3   NaN      M    A
4   NaN      F    B
5   NaN      M    D

#### Merge

In [52]:
df1

  name  age
0    A   30
1    B   40
2    C   50

In [53]:
df2

  name  age
0    X   40
1    Y   20

In [56]:
df3

  name gender
0    A      M
1    B      F
2    D      M

In [57]:
pd.merge(df1,df3)  # inner join by name

  name  age gender
0    A   30      M
1    B   40      F

In [64]:
pd.merge(df1,df3,on='name', how='outer')  # full outer join

  name   age gender
0    A  30.0      M
1    B  40.0      F
2    C  50.0    NaN
3    D   NaN      M

In [65]:
pd.merge(df1,df3,on='name',how='outer')  # full outer join based on col name

  name   age gender
0    A  30.0      M
1    B  40.0      F
2    C  50.0    NaN
3    D   NaN      M

In [68]:
df1.join(df3, rsuffix='2')

  name  age name2 gender
0    A   30     A      M
1    B   40     B      F
2    C   50     D      M

In [71]:
df1.join(df2, rsuffix='_second')

  name  age name_second  age_second
0    A   30           X        40.0
1    B   40           Y        20.0
2    C   50         NaN         NaN

### Reshaping DF

In [5]:
sales.sort_index(axis=1)  ## Sort by column labels

   Book City Month  Units
0  B100  VZG   JAN   10.0
1  B300  VZG   JAN   20.0
2  B100  VZG   FEB    4.0
3  B100  VZG   MAR   13.0
4  B100  HYD   JAN   30.0
5  B100  HYD   FEB   40.0
6  B100  HYD   MAR   10.0
7  B200  VZG   JAN   14.0
8  B200  HYD   FEB    NaN
9  B200  NaN   MAR    4.0

In [7]:
df1

  name  age
0    A   30
1    B   40
2    C   50

In [47]:
df1.reset_index()

   index name  age
0      0    A   30
1      1    B   40
2      2    C   50

In [12]:
df1.reset_index(drop=True,inplace=True)

In [13]:
df1

  name  age
0    A   30
1    B   40
2    C   50

In [16]:
ndf = df1.set_index('name')

In [17]:
ndf.columns

Index(['age'], dtype='object')

In [21]:
sales.sort_values(['City','Units'], ascending=False)

  Month  Book City  Units
1   JAN  B300  VZG   20.0
7   JAN  B200  VZG   14.0
3   MAR  B100  VZG   13.0
0   JAN  B100  VZG   10.0
2   FEB  B100  VZG    4.0
5   FEB  B100  HYD   40.0
4   JAN  B100  HYD   30.0
6   MAR  B100  HYD   10.0
8   FEB  B200  HYD    NaN
9   MAR  B200  NaN    4.0

In [22]:
sales.rename(columns={'Units':'Qty'})

  Month  Book City   Qty
0   JAN  B100  VZG  10.0
1   JAN  B300  VZG  20.0
2   FEB  B100  VZG   4.0
3   MAR  B100  VZG  13.0
4   JAN  B100  HYD  30.0
5   FEB  B100  HYD  40.0
6   MAR  B100  HYD  10.0
7   JAN  B200  VZG  14.0
8   FEB  B200  HYD   NaN
9   MAR  B200  NaN   4.0

In [23]:
df1.columns

Index(['name', 'age'], dtype='object')

In [24]:
df1.columns = ['Fullname','Age']

In [25]:
df1

  Fullname  Age
0        A   30
1        B   40
2        C   50

In [28]:
sales.Units.rank()

0    3.5
1    7.0
2    1.5
3    5.0
4    8.0
5    9.0
6    3.5
7    6.0
8    NaN
9    1.5
Name: Units, dtype: float64

In [52]:
df1.duplicated()

0    False
1    False
2    False
dtype: bool

#### Encoding

In [29]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   JAN  B300  VZG   20.0
2   FEB  B100  VZG    4.0
3   MAR  B100  VZG   13.0
4   JAN  B100  HYD   30.0
5   FEB  B100  HYD   40.0
6   MAR  B100  HYD   10.0
7   JAN  B200  VZG   14.0
8   FEB  B200  HYD    NaN
9   MAR  B200  NaN    4.0

In [30]:
pd.get_dummies(sales)

,Units,Month_FEB,Month_JAN,Month_MAR,Book_B100,Book_B200,Book_B300,City_HYD,City_VZG
0,10.0,0,1,0,1,0,0,0,1
1,20.0,0,1,0,0,0,1,0,1
2,4.0,1,0,0,1,0,0,0,1
3,13.0,0,0,1,1,0,0,0,1
4,30.0,0,1,0,1,0,0,1,0
5,40.0,1,0,0,1,0,0,1,0
6,10.0,0,0,1,1,0,0,1,0
7,14.0,0,1,0,0,1,0,0,1
8,NaN,1,0,0,0,1,0,1,0
9,4.0,0,0,1,0,1,0,0,0

#### Binning

In [33]:
ages = pd.Series([21,25,30,24,40,55,33,33,21,22])

In [35]:
pd.cut(ages,bins=3)

0    (20.966, 32.333]
1    (20.966, 32.333]
2    (20.966, 32.333]
3    (20.966, 32.333]
4    (32.333, 43.667]
5      (43.667, 55.0]
6    (32.333, 43.667]
7    (32.333, 43.667]
8    (20.966, 32.333]
9    (20.966, 32.333]
dtype: category
Categories (3, interval[float64]): [(20.966, 32.333] < (32.333, 43.667] < (43.667, 55.0]]

In [37]:
ages

0    21
1    25
2    30
3    24
4    40
5    55
6    33
7    33
8    21
9    22
dtype: int64

In [36]:
pd.cut(ages,bins=[13,22,30,60],labels=['Teens','Middle','Matured'],precision=0, right=False)

0      Teens
1     Middle
2    Matured
3     Middle
4    Matured
5    Matured
6    Matured
7    Matured
8      Teens
9     Middle
dtype: category
Categories (3, object): [Teens < Middle < Matured]

In [38]:
pd.qcut(ages,[0,.5,.75,1],precision=0)

0    (20.0, 28.0]
1    (20.0, 28.0]
2    (28.0, 33.0]
3    (20.0, 28.0]
4    (33.0, 55.0]
5    (33.0, 55.0]
6    (28.0, 33.0]
7    (28.0, 33.0]
8    (20.0, 28.0]
9    (20.0, 28.0]
dtype: category
Categories (3, interval[float64]): [(20.0, 28.0] < (28.0, 33.0] < (33.0, 55.0]]

### Grouping

In [44]:
month_group = sales.groupby('Month')

In [45]:
type(month_group)

pandas.core.groupby.generic.DataFrameGroupBy

In [46]:
month_group.groups

{'FEB': Int64Index([2, 5, 8], dtype='int64'),
 'JAN': Int64Index([0, 1, 4, 7], dtype='int64'),
 'MAR': Int64Index([3, 6, 9], dtype='int64')}

In [49]:
month_group.sum()

       Units
Month
FEB     44.0
JAN     74.0
MAR     27.0

In [50]:
month_group['Units'].agg( ['mean','sum'])

       mean   sum
Month
FEB    22.0  44.0
JAN    18.5  74.0
MAR     9.0  27.0

In [65]:
for gv,rows in g:
    print(gv)
    print(rows)

FEB
  Month  Book City  Units  Tax
2   FEB  B100  VZG    4.0   15
5   FEB  B100  HYD   40.0   15
8   FEB  B200  HYD    NaN   15
JAN
  Month  Book City  Units  Tax
0   JAN  B100  VZG   10.0   15
1   JAN  B300  VZG   20.0   15
4   JAN  B100  HYD   30.0   15
7   JAN  B200  VZG   14.0   15
MAR
   Month  Book City  Units  Tax
3    MAR  B100  VZG   13.0   15
6    MAR  B100  HYD   10.0   15
9    MAR  B200  NaN    4.0   15
11   MAR  B100  HYD   10.0   15
12   MAR  B200  HYD   20.0   15

In [66]:
g.get_group('FEB')

   Book City  Units  Tax
2  B100  VZG    4.0   15
5  B100  HYD   40.0   15
8  B200  HYD    NaN   15

In [67]:
g.agg( ['mean','sum','count'])

      Units              Tax
       mean   sum count mean sum count
Month
FEB    22.0  44.0     2   15  45     3
JAN    18.5  74.0     4   15  60     4
MAR    11.4  57.0     5   15  75     5

In [76]:
total = sales['Units'].sum()
print(total)

175.0

In [85]:
gs  = sales.groupby('Month').sum()
print(gs)
print(type(gs))

       Units  Tax
Month
FEB     44.0   45
JAN     74.0   60
MAR     57.0   75
<class 'pandas.core.frame.DataFrame'>

In [82]:
gs['Ratio_To_Total'] = gs['Units'] / total

In [83]:
gs

       Units  Tax  Ratio_To_Total
Month
FEB     44.0   45        0.251429
JAN     74.0   60        0.422857
MAR     57.0   75        0.325714

In [59]:
m_c_g = sales.groupby(['Month','City'])

In [60]:
m_c_g.sum()

            Units  Tax
Month City
FEB   HYD    40.0   30
      VZG     4.0   15
JAN   HYD    30.0   15
      VZG    44.0   45
MAR   HYD    40.0   45
      VZG    13.0   15

### NA related functions

In [95]:
sales.isna().any()   # Find columns with null values

Month    False
Book     False
City      True
Units     True
Tax      False
dtype: bool

In [97]:
sales.isna().sum()   # Find how many null values are present in each column

Month    0
Book     0
City     1
Units    1
Tax      0
dtype: int64

In [100]:
sales.isna().any(axis=1)   # Find rows that have null value

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9      True
11    False
12    False
dtype: bool

In [101]:
sales[sales.isna().any(axis=1)]

  Month  Book City  Units  Tax
8   FEB  B200  HYD    NaN   15
9   MAR  B200  NaN    4.0   15

In [103]:
sales.dropna(axis=1)

   Month  Book  Tax
0    JAN  B100   15
1    JAN  B300   15
2    FEB  B100   15
3    MAR  B100   15
4    JAN  B100   15
5    FEB  B100   15
6    MAR  B100   15
7    JAN  B200   15
8    FEB  B200   15
9    MAR  B200   15
11   MAR  B100   15
12   MAR  B200   15

In [105]:
sales.fillna( {'Units': 0} )

   Month  Book City  Units  Tax
0    JAN  B100  VZG   10.0   15
1    JAN  B300  VZG   20.0   15
2    FEB  B100  VZG    4.0   15
3    MAR  B100  VZG   13.0   15
4    JAN  B100  HYD   30.0   15
5    FEB  B100  HYD   40.0   15
6    MAR  B100  HYD   10.0   15
7    JAN  B200  VZG   14.0   15
8    FEB  B200  HYD    0.0   15
9    MAR  B200  NaN    4.0   15
11   MAR  B100  HYD   10.0   15
12   MAR  B200  HYD   20.0   15

In [106]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12 entries, 0 to 12
Data columns (total 5 columns):
Month    12 non-null object
Book     12 non-null object
City     11 non-null object
Units    11 non-null float64
Tax      12 non-null int64
dtypes: float64(1), int64(1), object(3)
memory usage: 896.0+ bytes

### Write to file

In [110]:
sales.to_json("sales.json", orient='records')

In [116]:
sg = sales.groupby('Month',as_index=False).sum()

In [117]:
sg

  Month  Units  Tax
0   FEB   44.0   45
1   JAN   74.0   60
2   MAR   57.0   75

In [118]:
sg = sales.groupby('Month').sum()
sg

       Units  Tax
Month
FEB     44.0   45
JAN     74.0   60
MAR     57.0   75

In [120]:
sales.pivot_table(index='Month',columns='City',values=['Units'], aggfunc=np.sum)

      Units
City    HYD   VZG
Month
FEB    40.0   4.0
JAN    30.0  44.0
MAR    40.0  13.0